/* 
  Localizable.strings
  PanicGit

  Created by Logan Collins on 2/24/18.
  Copyright © 2018 Panic Inc. All rights reserved.
*/


// Operations

// "Downloading Objects: 12 of 100 (100KB)"
"Downloading Objects: %@ of %@ (%@)" = "Downloading Objects: %@ of %@ (%@)";

// "Indexing Deltas: 12 of 100"
"Indexing Deltas: %@ of %@" = "Indexing Deltas: %@ of %@";

// "Packing Objects: 12 of 100"
"Packing Objects: %@ of %@" = "Packing Objects: %@ of %@";

// "Uploading Objects: 12 of 100 (100KB)"
"Uploading Objects: %@ of %@ (%@)" = "Uploading Objects: %@ of %@ (%@)";

// "Checking Out Files: 12 of 100"
"Checking Out Files: %@ of %@" = "Checking Out Files: %@ of %@";


// SSH host key authentication
"The %@ %@ fingerprint is:\n%@" = "The %@ %@ fingerprint is:\n%@";


// Errors
"Error returned from libgit2: %@ (%ld)" = "Error returned from libgit2: %@ (%ld)";
"Error code from libgit2: (%ld)" = "Error code from libgit2: (%ld)";

"The requested object was not found." = "The requested object was not found.";
"The requested object already exists." = "The requested object already exists.";
"Multiple ambiguous matching objects were found." = "Multiple ambiguous matching objects were found.";
"The provided buffer was too short." = "The provided buffer was too short.";
"This operation cannot be performed on a bare repository." = "This operation cannot be performed on a bare repository.";
"The branch contains no commits." = "The branch contains no commits.";
"Unmerged changes must be resolved before the operation can be performed." = "Unmerged changes must be resolved before the operation can be performed.";
"The reference cannot be fast-forwarded and must instead be merged or rebased." = "The reference cannot be fast-forwarded and must instead be merged or rebased.";
"The provided reference name or refspec was invalid." = "The provided reference name or refspec was invalid.";
"One or more conflicts prevented the operation from being performed.\n\nCommit or stash any uncommitted changes and try again." = "One or more conflicts prevented the operation from being performed.\n\nCommit or stash any uncommitted changes and try again.";
"There are locked files which prevented the operation from being performed." = "There are locked files which prevented the operation from being performed.";
"The reference has been modified by another operation." = "The reference has been modified by another operation.";
"Credentials were not accepted by the server. Make sure your password or SSH key is set up correctly.\n\nIf you are using an SSH config file, make sure it is not unexpectedly overriding options for the host." = "Credentials were not accepted by the server. Make sure your password or SSH key is set up correctly.\n\nIf you are using an SSH config file, make sure it is not unexpectedly overriding options for the host.";
"The certificate for the server is invalid. Make sure you have a valid secure connection to the server and that there is not a proxy server that may be downgrading security." = "The certificate for the server is invalid. Make sure you have a valid secure connection to the server and that there is not a proxy server that may be downgrading security.";
"The provided patch or merge has already been applied." = "The provided patch or merge has already been applied.";
"The requested peel operation is not possible." = "The requested peel operation is not possible.";
"An unexpected end of file was encountered." = "An unexpected end of file was encountered.";
"The requested operation or input is invalid." = "The requested operation or input is invalid.";
"There are uncommitted changes which must be committed or stashed before the operation can be performed." = "There are uncommitted changes which must be committed or stashed before the operation can be performed.";
"This operation is not valid for the specified directory." = "This operation is not valid for the specified directory.";
"There are merge conflicts which must be resolved before the operation can be performed." = "There are merge conflicts which must be resolved before the operation can be performed.";
"The hash sum of one or more objects does not match." = "The hash sum of one or more objects does not match.";
"Unsaved changes in the index would be overridden by the operation." = "Unsaved changes in the index would be overridden by the operation.";
"Failed to apply the patch." = "Failed to apply the patch.";
"The object is not owned by the current user." = "The object is not owned by the current user.";
"The operation was cancelled." = "The operation was cancelled.";


// Tasks
"Failed to invoke Git “%@” hook." = "Failed to invoke Git “%@” hook.";
"Failed to invoke Git credential helper." = "Failed to invoke Git credential helper.";

"Task “%@” terminated with an uncaught signal." = "Task “%@” terminated with an uncaught signal.";
"Task “%@” terminated with a non-zero exit code: %d." = "Task “%@” terminated with a non-zero exit code: %d.";


// Signing
"Invalid Git signing format specified." = "Invalid Git signing format specified.";
"The “gpg.format” configuration value is set to “%@”, which is not supported." = "The “gpg.format” configuration value is set to “%@”, which is not supported.";
"Could not sign payload using %@." = "Could not sign payload using %@.";
"A valid signing key was not provided using either `user.signingkey` or `gpg.ssh.defaultKeyCommand`." = "A valid signing key was not provided using either `user.signingkey` or `gpg.ssh.defaultKeyCommand`.";
"Task “%@” did not generate a signature in its output." = "Task “%@” did not generate a signature in its output.";


// Apply Stash
"Applying stash…" = "Applying stash…";
"Failed to apply stash." = "Failed to apply stash.";

// Checkout
"Checking out “%@”…" = "Checking out “%@”…";
"Checking out HEAD…" = "Checking out HEAD…";

"Failed to checkout tree." = "Failed to checkout tree.";

// Cherry-pick
"Cherry-picking “%@”…" = "Cherry-picking “%@”…";

"Failed to cherry-pick commits." = "Failed to cherry-pick commits.";

// Clone
"Cloning into “%@”…" = "Cloning into “%@”…";

"Failed to clone repository." = "Failed to clone repository.";

// Commit
"Committing “%@”…" = "Committing “%@”…";

"Failed to commit tree." = "Failed to commit tree.";

// Fetch
"Fetching from “%@”…" = "Fetching from “%@”…";
"Fetching “%@” from “%@”…" = "Fetching “%@” from “%@”…";
"Fetching %@ refs from “%@”…" = "Fetching %@ refs from “%@”…";

"Failed to fetch from “%@”." = "Failed to fetch from “%@”.";

// List References
"Listing remote references for “%@”…" = "Listing remote references for “%@”…"; // Where a "reference" is a Git remote reference (such as a branch or tag)

"Failed to fetch remote references from “%@”." = "Failed to fetch remote references from “%@”."; // Where a "reference" is a Git remote reference (such as a branch or tag)

// Merge
"Merging “%@”…" = "Merging “%@”…";
"Merging %@ references…" = "Merging %@ references…";

"Failed to merge references." = "Failed to merge references.";

// Prune
"Pruning references for “%@”…" = "Pruning references for “%@”…";

"Failed to prune remote references from “%@”." = "Failed to prune remote references from “%@”.";

// Push
"Pushing to “%@”…" = "Pushing to “%@”…";
"Pushing “%@” to “%@”…" = "Pushing “%@” to “%@”…";
"Pushing %@ refs to “%@”…" = "Pushing %@ refs to “%@”…";

"Failed to push to “%@”." = "Failed to push to “%@”.";

"Failed to push some references." = "Failed to push some references.";
"One or more references were rejected by the server." = "One or more references were rejected by the server.";

// Update submodule
"Updating submodule “%@”…" = "Updating submodule “%@”…";

"Failed to update submodule “%@”." = "Failed to update submodule “%@”.";
